using System;
using Xunit;

namespace CodeBasic.Tests
{
    public class PokdengTests
    {
        /*
         * Normal cases
         * แต้มผู้เล่นชนะเจ้ามือ ผู้เล่นได้รับเงินเพิ่มเท่ากับเงินที่ลงพนัน
         * แต้มผู้เล่นแพ้เจ้ามือ ผู้เล่นเสียเงินเท่ากับเงินที่ลงพนัน
         * แต้มผู้เล่นเสมอกับเจ้ามือ ผู้เล่นไม่เสียเงิน
         * ---
         * แต้มผู้เล่นชนะเจ้ามือ โดยผลรวมเกิน 9 ผู้เล่นได้รับเงินเพิ่มเท่ากับเงินที่ลงพนัน
         * แต้มผู้เล่นแพ้เจ้ามือ โดยผลรวมเกิน 9 ผู้เล่นเสียเงินเท่ากับเงินที่ลงพนัน
         * แต้มผู้เล่นเสมอกับเจ้ามือ โดยผลรวมเกิน 9 ผู้เล่นไม่เสียเงิน
         * ---
         * แต้มผู้เล่นชนะเจ้ามือโดยเป็นไพ่ป๊อก ผู้เล่นได้รับเงินเพิ่มเท่ากับเงินที่ลงพนัน
         * แต้มผู้เล่นแพ้เจ้ามือโดยเป็นไพ่ป๊อก ผู้เล่นเสียเงินเท่ากับเงินที่ลงพนัน
         * แต้มผู้เล่นเสมอกับเจ้ามือโดยเป็นไพ่ป๊อก ผู้เล่นไม่เสียเงิน
         * ---
         * ผู้เล่นลงเงินเกินที่ตัวเองมี ระบบแจ้งเตือนข้อผิดพลาด และยกเลิกการเล่นในรอบนั้นไป
         * 
         * 
         * Alternative cases
         * แต้มผู้เล่นชนะเจ้ามือ แบบสองเด้ง ผู้เล่นได้รับเงินเพิ่ม 2 เท่าของเงินที่ลงพนัน
         * แต้มผู้เล่นแพ้เจ้ามือ แบบสองเด้ง ผู้เล่นเสียเงิน 2 เท่าของเงินที่ลงพนัน
         * แต้มผู้เล่นเสมอกับเจ้ามือ แบบสองเด้ง ผู้เล่นไม่เสียเงิน
         * ---
         * แต้มผู้เล่นชนะเจ้ามือ แบบป๊อกสองเด้ง ผู้เล่นได้รับเงินเพิ่ม 2 เท่าของเงินที่ลงพนัน
         * แต้มผู้เล่นแพ้เจ้ามือ แบบป๊อกสองเด้ง ผู้เล่นเสียเงิน 2 เท่าของเงินที่ลงพนัน
         * แต้มผู้เล่นเสมอกับเจ้ามือ แบบป๊อกสองเด้ง ผู้เล่นไม่เสียเงิน
         * ---
         * แต้มผู้เล่นชนะเจ้ามือ แบบสามเด้ง ผู้เล่นได้รับเงินเพิ่ม 3 เท่าของเงินที่ลงพนัน
         * แต้มผู้เล่นแพ้เจ้ามือ แบบสามเด้ง ผู้เล่นเสียเงิน 3 เท่าของเงินที่ลงพนัน
         * แต้มผู้เล่นเสมอกับเจ้ามือ แบบสามเด้ง ผู้เล่นไม่เสียเงิน
         * ---
         * แต้มผู้เล่นชนะเจ้ามือ แบบไพ่เรียง ผู้เล่นได้รับเงินเพิ่ม 3 เท่าของเงินที่ลงพนัน
         * แต้มผู้เล่นแพ้เจ้ามือ แบบไพ่เรียง ผู้เล่นเสียเงิน 3 เท่าของเงินที่ลงพนัน
         * แต้มผู้เล่นเสมอกับเจ้ามือ แบบไพ่เรียง ผู้เล่นไม่เสียเงิน
         * ---
         * แต้มผู้เล่นชนะเจ้ามือ แบบไพ่ผี ผู้เล่นได้รับเงินเพิ่ม 3 เท่าของเงินที่ลงพนัน
         * แต้มผู้เล่นแพ้เจ้ามือ แบบไพ่ผี ผู้เล่นเสียเงิน 3 เท่าของเงินที่ลงพนัน
         * แต้มผู้เล่นเสมอกับเจ้ามือ แบบไพ่ผี ผู้เล่นไม่เสียเงิน
         * ---
         * แต้มผู้เล่นชนะเจ้ามือ แบบไพ่ตอง ผู้เล่นได้รับเงินเพิ่ม 5 เท่าของเงินที่ลงพนัน
         * แต้มผู้เล่นแพ้เจ้ามือ แบบไพ่ตอง ผู้เล่นเสียเงิน 5 เท่าของเงินที่ลงพนัน
         * แต้มผู้เล่นเสมอกับเจ้ามือ แบบไพ่ตอง ผู้เล่นไม่เสียเงิน
         * ---
         * ผู้เล่นได้ไพ่ป๊อก เจ้ามือได้ไพ่เรียง ผู้เล่นได้รับเงินเพิ่มเท่ากับเงินที่ลงพนัน
         * ผู้เล่นได้ไพ่ป๊อก เจ้ามือได้ไพ่ผี ผู้เล่นได้รับเงินเพิ่มเท่ากับเงินที่ลงพนัน
         * ผู้เล่นได้ไพ่ป๊อก เจ้ามือได้ไพ่ตอง ผู้เล่นได้รับเงินเพิ่มเท่ากับเงินที่ลงพนัน
         * ผู้เล่นได้ไพ่ป๊อก เจ้ามือได้ไพ่สามเด้ง ผู้เล่นได้รับเงินเพิ่มเท่ากับเงินที่ลงพนัน
         * ---
         * ผู้เล่นได้ไพ่ป๊อกสองเด้ง เจ้ามือได้ไพ่เรียง ผู้เล่นได้รับเงินเพิ่ม 2 เท่าของเงินที่ลงพนัน
         * ผู้เล่นได้ไพ่ป๊อกสองเด้ง เจ้ามือได้ไพ่ผี ผู้เล่นได้รับเงินเพิ่ม 2 เท่าของเงินที่ลงพนัน
         * ผู้เล่นได้ไพ่ป๊อกสองเด้ง เจ้ามือได้ไพ่ตอง ผู้เล่นได้รับเงินเพิ่ม 2 เท่าของเงินที่ลงพนัน
         * ผู้เล่นได้ไพ่ป๊อกสองเด้ง เจ้ามือได้ไพ่สามเด้ง ผู้เล่นได้รับเงินเพิ่ม 2 เท่าของเงินที่ลงพนัน
         * ---
         * เจ้ามือได้ไพ่ป๊อก ผู้เล่นได้ไพ่เรียง ผู้เล่นเสียเงินเท่ากับเงินที่ลงพนัน
         * เจ้ามือได้ไพ่ป๊อก ผู้เล่นได้ไพ่ผี ผู้เล่นเสียเงินเท่ากับเงินที่ลงพนัน
         * เจ้ามือได้ไพ่ป๊อก ผู้เล่นได้ไพ่ตอง ผู้เล่นเสียเงินเท่ากับเงินที่ลงพนัน
         * เจ้ามือได้ไพ่ป๊อก ผู้เล่นได้ไพ่สามเด้ง ผู้เล่นเสียเงินเท่ากับเงินที่ลงพนัน
         * ---
         * เจ้ามือได้ไพ่ป๊อกสองเด้ง ผู้เล่นได้ไพ่เรียง ผู้เล่นเสียเงิน 2 เท่าของเงินที่ลงพนัน
         * เจ้ามือได้ไพ่ป๊อกสองเด้ง ผู้เล่นได้ไพ่ผี ผู้เล่นเสียเงิน 2 เท่าของเงินที่ลงพนัน
         * เจ้ามือได้ไพ่ป๊อกสองเด้ง ผู้เล่นได้ไพ่ตอง ผู้เล่นเสียเงิน 2 เท่าของเงินที่ลงพนัน
         * เจ้ามือได้ไพ่ป๊อกสองเด้ง ผู้เล่นได้ไพ่สามเด้ง ผู้เล่นเสียเงิน 2 เท่าของเงินที่ลงพนัน
         * ---
         * ผู้เล่นเสียเงินเกินที่ตัวเองมี ระบบแจ้งเตือนข้อผิดพลาด และยกเลิกการเล่นในรอบนั้นไป
         * ผู้เล่นและเจ้ามือได้ไพ่ตองทั้งคู่ ผู้เล่นไม่เสียเงิน
         * ผู้เล่นและเจ้ามือได้ไพ่ผีทั้งคู่ ผู้เล่นไม่เสียเงิน
         * ผู้เล่นและเจ้ามือได้ไพ่เรียงทั้งคู่ ผู้เล่นไม่เสียเงิน
         * 
         * Exception cases
         * ผู้เล่นมีเงินไม่พอจ่าย ระบบแจ้งเตือนข้อผิดพลาด และยกเลิกการเล่นในรอบนั้นไป
         * ผู้เล่นลงเงินไม่ถูกต้อง ระบบแจ้งเตือนข้อผิดพลาด และยกเลิกการเล่นในรอบนั้นไป
         * เจ้ามือได้ไพ่ป๊อก ผู้เล่นมีไพ่ 3 ใบ ระบบจะคำนวณแค่ไพ่ 2 ใบแรกของผู้เล่น
         * ได้รับไพ่ที่ไม่ถูกต้อง ระบบแจ้งเตือนข้อผิดพลาด และยกเลิกการเล่นในรอบนั้นไป
         */

        [Fact]
        public void Test1()
        {

        }
    }
}
